app/views/home/authenticated/_donation_request_history.html.erb

                      <td><%= dr.date_created %></td>
                      <td><%= link_to dr.donation_items.count, "#" %></td>
---
SELECT "donations".* FROM "donations" WHERE "donations"."donation_request_id" IN (5, 6, 7, 8)