app/controllers/donation_requests_controller.rb

  def create
    @donation_request = DonationRequest.new(donation_request_params)

    @donation_request.user_id = current_user.id
    if @donation_request.save
---
INSERT INTO "donation_requests" ("user_id", "description", "notes", "contact_first", "contact_last", "contact_email", "contact_phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)