app/controllers/donations_controller.rb

  def index
    @donation_requests = DonationRequest.all
---
SELECT "donation_requests".* FROM "donation_requests"