app/controllers/home_controller.rb

SELECT "donation_requests".* FROM "donation_requests" WHERE "donation_requests"."user_id" = ?  [["user_id", 3]]
SELECT "donations".* FROM "donations" WHERE "donations"."donation_request_id" IN (5, 6, 7, 8)
SELECT "donation_items".* FROM "donation_items" WHERE "donation_items"."resource_type" = ? AND 1=0  [["resource_type", "Donation"]]
---
  def index
    if user_signed_in?
      @user = current_user
      @user_profile = @user.user_profile
      if current_user.organization
        @donation_requests = DonationRequest.where(user_id: current_user.id).includes(:donations)
        @donations = @donation_requests.map(&:donations).flatten
        @items_received = DonationItem.where(resource_type: Donation.name, resource_id: @donations.map(&:id))

SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."organization" = ?  [["organization", "t"]]
---
  def nearby_organizations
    @orgs = User.where(organization: true)