app/controllers/user_profiles_controller.rb

  def update
    user = current_user
    @user_profile = user.user_profile
    if @user_profile.user_id != current_user.id
      redirect_to root_path and return
    end
    @user_profile.attributes = user_profile_params
    if @user_profile.save!
---
UPDATE "user_profiles" SET "display_name" = ?, "gender" = ?, "city" = ?, "state" = ?, "zip" = ?, "address" = ?, "phone" = ?, "bio" = ?, "updated_at" = ? WHERE "user_profiles"."id" = ?  [["display_name", "Mr. Muffins"], ["gender", ""], ["city", ""], ["state", ""], ["zip", ""], ["address", ""], ["phone", ""], ["bio", ""], ["updated_at", "2017-09-24 19:44:19.759082"], ["id", 1]]